
[;1mÂ Â tl(List)[0m

  Returns the tail of [;;4mList[0m, that is, the list minus the first
  element

  It works with improper lists.

  Examples:

    > tl([geesties, guilies, beasties]).
    [guilies, beasties]

    > tl([geesties]).
    []

    > tl([geesties, guilies, beasties | improper_end]).
    [guilies, beasties | improper_end]

    > tl([geesties | improper_end]).
    improper_end

  Failure: [;;4mbadarg[0m if [;;4mList[0m is an empty list [;;4m[][0m.
